In [1]:
import pandas as pd

In [2]:
s = pd.Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s.dtype

dtype('int64')

In [4]:
s.values

array([10, 20, 30, 40, 50])

In [5]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
s.name = "Calories"
s

0    10
1    20
2    30
3    40
4    50
Name: Calories, dtype: int64

### Indexing

In [7]:

s[0]
s[0:3]

0    10
1    20
2    30
Name: Calories, dtype: int64

In [8]:
# iloc -> location based indexing

s.iloc[3]

np.int64(40)

In [9]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: Calories, dtype: int64

In [10]:
index = ["apple","banana","grapes","orange","strawberry"]

In [11]:
s.index = index
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: Calories, dtype: int64

In [12]:
 # loc -> label based indexing
s.loc['grapes']

np.int64(30)

In [13]:
# label based indexing your start and stop value both are included in the output.
s['banana':'strawberry']

banana        20
grapes        30
orange        40
strawberry    50
Name: Calories, dtype: int64

In [14]:
fruit_protein = {
    "Apple": 1.4,
    "Banana": 1.1,
    "Mango": 2.8,
    "Orange": 0.9,
    "Papaya": 0.5,
    "Guava": 2.6,
    "Pineapple": 0.5,
    "Watermelon": 0.9
}
s2 = pd.Series(fruit_protein)
s2

Apple         1.4
Banana        1.1
Mango         2.8
Orange        0.9
Papaya        0.5
Guava         2.6
Pineapple     0.5
Watermelon    0.9
dtype: float64

In [15]:
s2 = pd.Series(fruit_protein, name = 'Protein' )
s2

Apple         1.4
Banana        1.1
Mango         2.8
Orange        0.9
Papaya        0.5
Guava         2.6
Pineapple     0.5
Watermelon    0.9
Name: Protein, dtype: float64

In [16]:
import pandas as pd

fruit_protein = {'Fruit': ['Apple', 'Banana', 'Mango', 'Orange', 'Papaya', 'Guava', 'Pineapple', 'Watermelon'], 'Protein (g)': [0.3, 1.1, 0.8, 0.9, 0.5, 2.6, 0.5, 0.9]}
s2 = protein_series = pd.Series(fruit_protein['Protein (g)'], index=fruit_protein['Fruit'])
s2

Apple         0.3
Banana        1.1
Mango         0.8
Orange        0.9
Papaya        0.5
Guava         2.6
Pineapple     0.5
Watermelon    0.9
dtype: float64

In [17]:
s2.name = "Protein"
s2

Apple         0.3
Banana        1.1
Mango         0.8
Orange        0.9
Papaya        0.5
Guava         2.6
Pineapple     0.5
Watermelon    0.9
Name: Protein, dtype: float64

In [18]:
s2.dtype

dtype('float64')

In [19]:
## Data Frame:

data = {
    "Name": ["Amit Sharma", "Priya Mehta", "Ravi Kumar","Umar Pathan", "Neha Singh", "Arjun Patel"],
    "Age": [28, 32, 25, 29,26, 35],
    "Department": ["HR", "Finance", "IT", "HR", "HR","IT"],
    "Salary": [45000, 60000, 52000, 48000,20000, 70000]
}
data

{'Name': ['Amit Sharma',
  'Priya Mehta',
  'Ravi Kumar',
  'Umar Pathan',
  'Neha Singh',
  'Arjun Patel'],
 'Age': [28, 32, 25, 29, 26, 35],
 'Department': ['HR', 'Finance', 'IT', 'HR', 'HR', 'IT'],
 'Salary': [45000, 60000, 52000, 48000, 20000, 70000]}

In [20]:
df = pd.DataFrame(data)
df

          Name  Age Department  Salary
0  Amit Sharma   28         HR   45000
1  Priya Mehta   32    Finance   60000
2   Ravi Kumar   25         IT   52000
3  Umar Pathan   29         HR   48000
4   Neha Singh   26         HR   20000
5  Arjun Patel   35         IT   70000

In [21]:
df.head(2)

          Name  Age Department  Salary
0  Amit Sharma   28         HR   45000
1  Priya Mehta   32    Finance   60000

In [22]:
df.tail(2)

          Name  Age Department  Salary
4   Neha Singh   26         HR   20000
5  Arjun Patel   35         IT   70000

In [23]:
## iloc and loc 

df.iloc[1:3]

          Name  Age Department  Salary
1  Priya Mehta   32    Finance   60000
2   Ravi Kumar   25         IT   52000

In [24]:
df.loc[1:3]

          Name  Age Department  Salary
1  Priya Mehta   32    Finance   60000
2   Ravi Kumar   25         IT   52000
3  Umar Pathan   29         HR   48000

In [25]:
df.loc[1:4, ["Age","Salary"]]

   Age  Salary
1   32   60000
2   25   52000
3   29   48000
4   26   20000

In [26]:
df.iloc[1:4, :2]

          Name  Age
1  Priya Mehta   32
2   Ravi Kumar   25
3  Umar Pathan   29

In [27]:
df["Name"]

0    Amit Sharma
1    Priya Mehta
2     Ravi Kumar
3    Umar Pathan
4     Neha Singh
5    Arjun Patel
Name: Name, dtype: object

In [28]:
df[["Age","Name","Department","Salary"]]

   Age         Name Department  Salary
0   28  Amit Sharma         HR   45000
1   32  Priya Mehta    Finance   60000
2   25   Ravi Kumar         IT   52000
3   29  Umar Pathan         HR   48000
4   26   Neha Singh         HR   20000
5   35  Arjun Patel         IT   70000

In [29]:
df.drop('Age' , axis=1)

          Name Department  Salary
0  Amit Sharma         HR   45000
1  Priya Mehta    Finance   60000
2   Ravi Kumar         IT   52000
3  Umar Pathan         HR   48000
4   Neha Singh         HR   20000
5  Arjun Patel         IT   70000

In [30]:
df

          Name  Age Department  Salary
0  Amit Sharma   28         HR   45000
1  Priya Mehta   32    Finance   60000
2   Ravi Kumar   25         IT   52000
3  Umar Pathan   29         HR   48000
4   Neha Singh   26         HR   20000
5  Arjun Patel   35         IT   70000

In [31]:
df.shape

(6, 4)

In [32]:

df.dtypes

Name          object
Age            int64
Department    object
Salary         int64
dtype: object

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   Department  6 non-null      object
 3   Salary      6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [34]:
##  Braodcasting

df["Salary"] = df["Salary"] + 5000
df

          Name  Age Department  Salary
0  Amit Sharma   28         HR   50000
1  Priya Mehta   32    Finance   65000
2   Ravi Kumar   25         IT   57000
3  Umar Pathan   29         HR   53000
4   Neha Singh   26         HR   25000
5  Arjun Patel   35         IT   75000

In [35]:
## Renaming Columns:

df.rename(columns={"Name":"Employee Name"}, inplace=True)
df

  Employee Name  Age Department  Salary
0   Amit Sharma   28         HR   50000
1   Priya Mehta   32    Finance   65000
2    Ravi Kumar   25         IT   57000
3   Umar Pathan   29         HR   53000
4    Neha Singh   26         HR   25000
5   Arjun Patel   35         IT   75000

In [36]:
df.rename(columns={"Department":"Dept"}, inplace=True)
df

  Employee Name  Age     Dept  Salary
0   Amit Sharma   28       HR   50000
1   Priya Mehta   32  Finance   65000
2    Ravi Kumar   25       IT   57000
3   Umar Pathan   29       HR   53000
4    Neha Singh   26       HR   25000
5   Arjun Patel   35       IT   75000

In [37]:
df.rename(columns={"Employee Name":"Name"}, inplace=True)
df

          Name  Age     Dept  Salary
0  Amit Sharma   28       HR   50000
1  Priya Mehta   32  Finance   65000
2   Ravi Kumar   25       IT   57000
3  Umar Pathan   29       HR   53000
4   Neha Singh   26       HR   25000
5  Arjun Patel   35       IT   75000

In [38]:
df.rename(columns={"Nmae":"Name"}, inplace=True)
df

          Name  Age     Dept  Salary
0  Amit Sharma   28       HR   50000
1  Priya Mehta   32  Finance   65000
2   Ravi Kumar   25       IT   57000
3  Umar Pathan   29       HR   53000
4   Neha Singh   26       HR   25000
5  Arjun Patel   35       IT   75000

In [39]:
df["Salary"].unique()

array([50000, 65000, 57000, 53000, 25000, 75000])

In [40]:
df["Dept"].unique()

array(['HR', 'Finance', 'IT'], dtype=object)

In [41]:
df["Dept"].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [42]:
df["Prmoted Salary"] =df["Salary"] * 10
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3  Umar Pathan   29       HR   53000          530000
4   Neha Singh   26       HR   25000          250000
5  Arjun Patel   35       IT   75000          750000

In [43]:
## Data Cleaning 

df.isnull().sum()

Name              0
Age               0
Dept              0
Salary            0
Prmoted Salary    0
dtype: int64

In [44]:
df.dropna()

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3  Umar Pathan   29       HR   53000          530000
4   Neha Singh   26       HR   25000          250000
5  Arjun Patel   35       IT   75000          750000

In [45]:
df.fillna(0)

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3  Umar Pathan   29       HR   53000          530000
4   Neha Singh   26       HR   25000          250000
5  Arjun Patel   35       IT   75000          750000

In [46]:
df["Age"].fillna(df["Age"].mean())

0    28
1    32
2    25
3    29
4    26
5    35
Name: Age, dtype: int64

In [47]:
df["Salary"].fillna(df["Salary"].median())

0    50000
1    65000
2    57000
3    53000
4    25000
5    75000
Name: Salary, dtype: int64

In [48]:
##  Forward fill 

df["Age"].fillna(method = "ffill")

C:\Users\Pathan Umar\AppData\Local\Temp\ipykernel_25540\2820591561.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "ffill")

0    28
1    32
2    25
3    29
4    26
5    35
Name: Age, dtype: int64

In [49]:
##  Backrward fill 

df["Age"].fillna(method = "bfill")

C:\Users\Pathan Umar\AppData\Local\Temp\ipykernel_25540\584215362.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "bfill")

0    28
1    32
2    25
3    29
4    26
5    35
Name: Age, dtype: int64

In [50]:
df["Name"].replace("Arjun Patel","Sahil")

0    Amit Sharma
1    Priya Mehta
2     Ravi Kumar
3    Umar Pathan
4     Neha Singh
5          Sahil
Name: Name, dtype: object

In [51]:
df["Name"].replace("Umar Pathan", "Umar").inplace=True
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3  Umar Pathan   29       HR   53000          530000
4   Neha Singh   26       HR   25000          250000
5  Arjun Patel   35       IT   75000          750000

In [52]:
df["Name"] = df["Name"].replace("Umar Pathan", "Umar")
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3         Umar   29       HR   53000          530000
4   Neha Singh   26       HR   25000          250000
5  Arjun Patel   35       IT   75000          750000

In [53]:
df["Age"] = df["Age"].replace(29,25)
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3         Umar   25       HR   53000          530000
4   Neha Singh   26       HR   25000          250000
5  Arjun Patel   35       IT   75000          750000

In [54]:
## Dealing with duplicate Data

df_dup = df[df.duplicated()]
df_dup

Empty DataFrame
Columns: [Name, Age, Dept, Salary, Prmoted Salary]
Index: []

In [55]:
df.replace({
    "Name": {"Neha Singh": "Umar"},
    "Age": {26:25},
    "Department": {"HR": "HR"},
    "Salary": {25000: 53000},
    "Prmoted Salary": {250000: 530000}
}, inplace=True)

In [56]:
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3         Umar   25       HR   53000          530000
4         Umar   25       HR   53000          530000
5  Arjun Patel   35       IT   75000          750000

In [57]:
## Dealing with duplicate Data

df_dup = df[df.duplicated( keep= "last")]
df_dup

   Name  Age Dept  Salary  Prmoted Salary
3  Umar   25   HR   53000          530000

In [58]:
df_dup = df[df.duplicated()]
df_dup
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000          500000
1  Priya Mehta   32  Finance   65000          650000
2   Ravi Kumar   25       IT   57000          570000
3         Umar   25       HR   53000          530000
4         Umar   25       HR   53000          530000
5  Arjun Patel   35       IT   75000          750000

In [59]:
## Invalid values:
## Lambda -> python:

df["Prmoted Salary"] = df["Prmoted Salary"].apply(lambda x: x / 10 if x > 530000 else x)

In [60]:
df

          Name  Age     Dept  Salary  Prmoted Salary
0  Amit Sharma   28       HR   50000        500000.0
1  Priya Mehta   32  Finance   65000         65000.0
2   Ravi Kumar   25       IT   57000         57000.0
3         Umar   25       HR   53000        530000.0
4         Umar   25       HR   53000        530000.0
5  Arjun Patel   35       IT   75000         75000.0

In [61]:
Name = "Amit Sharma"
df[["first_name", "last_name"]] = df["Name"].str.split(" ", n=1, expand=True)
df

          Name  Age     Dept  Salary  Prmoted Salary first_name last_name
0  Amit Sharma   28       HR   50000        500000.0       Amit    Sharma
1  Priya Mehta   32  Finance   65000         65000.0      Priya     Mehta
2   Ravi Kumar   25       IT   57000         57000.0       Ravi     Kumar
3         Umar   25       HR   53000        530000.0       Umar      None
4         Umar   25       HR   53000        530000.0       Umar      None
5  Arjun Patel   35       IT   75000         75000.0      Arjun     Patel

In [62]:
## Apply And Lambda
def multipying_age(x):
  return x*2

df["Age"] = df['Age'].apply( multipying_age)

In [63]:
df

          Name  Age     Dept  Salary  Prmoted Salary first_name last_name
0  Amit Sharma   56       HR   50000        500000.0       Amit    Sharma
1  Priya Mehta   64  Finance   65000         65000.0      Priya     Mehta
2   Ravi Kumar   50       IT   57000         57000.0       Ravi     Kumar
3         Umar   50       HR   53000        530000.0       Umar      None
4         Umar   50       HR   53000        530000.0       Umar      None
5  Arjun Patel   70       IT   75000         75000.0      Arjun     Patel

In [64]:
df["Age"] = df["Age"].apply(lambda x: x/2)
df

          Name   Age     Dept  Salary  Prmoted Salary first_name last_name
0  Amit Sharma  28.0       HR   50000        500000.0       Amit    Sharma
1  Priya Mehta  32.0  Finance   65000         65000.0      Priya     Mehta
2   Ravi Kumar  25.0       IT   57000         57000.0       Ravi     Kumar
3         Umar  25.0       HR   53000        530000.0       Umar      None
4         Umar  25.0       HR   53000        530000.0       Umar      None
5  Arjun Patel  35.0       IT   75000         75000.0      Arjun     Patel

In [65]:
## Joins and Merges

dept_info = {
    "Dept": ["HR", "Finance", "IT", "Marketing"],
    "Location": ["Delhi", "Mumbai", "Bangalore", "Hyderabad"],
    "Manager": ["Amit Sharma", "Priya Mehta", "Ravi Kumar", "Neha Singh"]
}

df2 = pd.DataFrame(dept_info)
df2

        Dept   Location      Manager
0         HR      Delhi  Amit Sharma
1    Finance     Mumbai  Priya Mehta
2         IT  Bangalore   Ravi Kumar
3  Marketing  Hyderabad   Neha Singh

In [66]:
# Concat  

pd.concat([df, df2])

,Name,Age,Dept,Salary,Prmoted Salary,first_name,last_name,Location,Manager
0,Amit Sharma,28.0,HR,50000.0,500000.0,Amit,Sharma,NaN,NaN
1,Priya Mehta,32.0,Finance,65000.0,65000.0,Priya,Mehta,NaN,NaN
2,Ravi Kumar,25.0,IT,57000.0,57000.0,Ravi,Kumar,NaN,NaN
3,Umar,25.0,HR,53000.0,530000.0,Umar,None,NaN,NaN
4,Umar,25.0,HR,53000.0,530000.0,Umar,None,NaN,NaN
5,Arjun Patel,35.0,IT,75000.0,75000.0,Arjun,Patel,NaN,NaN
0,NaN,NaN,HR,NaN,NaN,NaN,NaN,Delhi,Amit Sharma
1,NaN,NaN,Finance,NaN,NaN,NaN,NaN,Mumbai,Priya Mehta
2,NaN,NaN,IT,NaN,NaN,NaN,NaN,Bangalore,Ravi Kumar
3,NaN,NaN,Marketing,NaN,NaN,NaN,NaN,Hyderabad,Neha Singh

In [67]:
pd.concat([df, df2], axis=1)

,Name,Age,Dept,Salary,Prmoted Salary,first_name,last_name,Dept,Location,Manager
0,Amit Sharma,28.0,HR,50000,500000.0,Amit,Sharma,HR,Delhi,Amit Sharma
1,Priya Mehta,32.0,Finance,65000,65000.0,Priya,Mehta,Finance,Mumbai,Priya Mehta
2,Ravi Kumar,25.0,IT,57000,57000.0,Ravi,Kumar,IT,Bangalore,Ravi Kumar
3,Umar,25.0,HR,53000,530000.0,Umar,None,Marketing,Hyderabad,Neha Singh
4,Umar,25.0,HR,53000,530000.0,Umar,None,NaN,NaN,NaN
5,Arjun Patel,35.0,IT,75000,75000.0,Arjun,Patel,NaN,NaN,NaN

In [68]:
pd.merge(df, df2, on="Dept")

,Name,Age,Dept,Salary,Prmoted Salary,first_name,last_name,Location,Manager
0,Amit Sharma,28.0,HR,50000,500000.0,Amit,Sharma,Delhi,Amit Sharma
1,Priya Mehta,32.0,Finance,65000,65000.0,Priya,Mehta,Mumbai,Priya Mehta
2,Ravi Kumar,25.0,IT,57000,57000.0,Ravi,Kumar,Bangalore,Ravi Kumar
3,Umar,25.0,HR,53000,530000.0,Umar,None,Delhi,Amit Sharma
4,Umar,25.0,HR,53000,530000.0,Umar,None,Delhi,Amit Sharma
5,Arjun Patel,35.0,IT,75000,75000.0,Arjun,Patel,Bangalore,Ravi Kumar